[
    {
      "bookId": 7,
      "bookName": "The Midnight Library",
      "author": "Matt Haig",
      "image": "https://i.ibb.co/gMMQMFY/the-midnight-library-900x600-removebg-preview.png",
      "review": "The Midnight Library is a profoundly moving and life-affirming novel that explores the choices we make and the paths we take in life. Nora Seed finds herself in the Midnight Library, a place between life and death, where she gets the chance to try out different versions of her life. Each book on the shelves represents a different life she could have lived, and Nora must navigate through these alternate realities to find the one where she truly belongs. Matt Haig's writing is poignant and insightful, delving into themes of regret, second chances, and the search for meaning. The characters are beautifully drawn, and the story is both heartwarming and thought-provoking. The Midnight Library is a book that will stay with you long after you've turned the last page, reminding you to cherish the life you have and the endless possibilities that lie ahead.",
      "totalPages": 304,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Philosophical", "Fantasy"],
      "publisher": "Viking",
      "yearOfPublishing": 2020
    },
    {
      "bookId": 8,
      "bookName": "Where the Crawdads Sing",
      "author": "Delia Owens",
      "image": "https://i.ibb.co/27CD0Z4/Where-The-Crawdads-Sing-Book-Club-Questions-Book-Club-Chat-removebg-preview.png",
      "review": "Where the Crawdads Sing is a mesmerizing and atmospheric novel set in the marshes of North Carolina. It tells the story of Kya Clark, known as the Marsh Girl, who grows up isolated from society but finds solace and understanding in the natural world around her. When a local man is found dead, Kya becomes the prime suspect, and the town's prejudices and secrets are brought to light. Delia Owens' writing is lyrical and evocative, painting a vivid picture of the marshland and its inhabitants. The novel is a compelling blend of mystery, romance, and coming-of-age, with themes of loneliness, resilience, and the power of nature. Where the Crawdads Sing is a captivating read that will transport you to another time and place, leaving a lasting impression.",
      "totalPages": 384,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Mystery", "Romance"],
      "publisher": "G.P. Putnam's Sons",
      "yearOfPublishing": 2018
    },
    {
      "bookId": 9,
      "bookName": "The Vanishing Half",
      "author": "Brit Bennett",
      "image": "https://i.ibb.co/Krcp0X1/book-review-the-vanishing-half-by-brit-bennett-seasoned-with-sydney-removebg-preview.png",
      "review": "The Vanishing Half is a stunning and thought-provoking novel that explores race, identity, and family bonds. The story follows the lives of identical twin sisters, Desiree and Stella, who grow up in a small, southern black community but eventually choose different paths: one passing as white and the other embracing her black heritage. As their lives diverge, their choices have far-reaching consequences for themselves and the next generation. Brit Bennett's writing is masterful, tackling complex themes with sensitivity and depth. The characters are richly drawn, and the narrative is both poignant and gripping. The Vanishing Half is a powerful examination of racial passing and the enduring ties that bind us to our past.",
      "totalPages": 352,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Race", "Family Drama"],
      "publisher": "Riverhead Books",
      "yearOfPublishing": 2020
    },
    {
      "bookId": 10,
      "bookName": "The Invisible Life of Addie LaRue",
      "author": "V.E. Schwab",
      "image": "https://i.ibb.co/jLVkFKL/book-club-questions-the-invisible-life-of-addie-larue-book-club-chat-removebg-preview.png",
      "review": "The Invisible Life of Addie LaRue is a captivating and lyrical tale that spans centuries and continents. Addie LaRue makes a Faustian bargain to live forever but is cursed to be forgotten by everyone she meets. Her story unfolds across history as she navigates the joys and sorrows of an immortal life, longing for connection and leaving her mark on the world. V.E. Schwab's writing is enchanting, weaving together themes of identity, memory, and the search for meaning. The characters are vividly drawn, and the narrative is filled with twists and turns that keep you engaged until the very end. The Invisible Life of Addie LaRue is a spellbinding novel that will linger in your thoughts long after you've finished reading.",
      "totalPages": 448,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["Historical Fiction", "Romance"],
      "publisher": "Tor Books",
      "yearOfPublishing": 2020
    },
    {
      "bookId": 11,
      "bookName": "Mexican Gothic",
      "author": "Silvia Moreno-Garcia",
      "image": "https://i.ibb.co/0YdywVP/mexicangothic-removebg-preview.png",
      "review": "Mexican Gothic is a chilling and atmospheric novel that blends elements of horror, mystery, and Gothic fiction. Set in 1950s Mexico, it follows Noemí Taboada, a socialite who travels to a remote mansion in the mountains to rescue her cousin from a troubled marriage. But the house holds dark secrets, and Noemí soon finds herself entangled in a sinister web of family secrets, madness, and ancient rituals. Silvia Moreno-Garcia's writing is hauntingly beautiful, evoking a sense of dread and unease that lingers long after the final page. The characters are vividly drawn, and the setting is richly atmospheric, immersing you in a world of mystery and terror. Mexican Gothic is a gripping and unsettling read that will keep you on the edge of your seat until the very end.",
      "totalPages": 352,
      "rating": 4.4,
      "category": "Horror",
      "tags": ["Gothic", "Mystery"],
      "publisher": "Del Rey Books",
      "yearOfPublishing": 2020
    },
    {
        "bookId": 13,
        "bookName": "Echoes of Eternity",
        "author": "Aria L. Moore",
        "image": "https://i.ibb.co/M9jsR55/R9-SWk-WVG0d-J7155j-removebg-preview.png",
        "review": "Echoes of Eternity is a gripping science fiction epic that takes readers on a journey across the cosmos. Set in a distant future where humanity has colonized the stars, the story follows Captain Elena Reyes and her crew aboard the starship Elysium as they embark on a perilous mission to uncover the secrets of a long-lost alien civilization. As they journey deeper into uncharted space, they encounter ancient mysteries, deadly adversaries, and the echoes of a forgotten past. Aria L. Moore's writing is immersive and exhilarating, blending pulse-pounding action with thought-provoking themes of identity, discovery, and the nature of existence. Echoes of Eternity is a thrilling adventure that will leave readers spellbound until the very end.",
        "totalPages": 432,
        "rating": 4.9,
        "category": "Science Fiction",
        "tags": ["Space Exploration", "Alien Civilization"],
        "publisher": "Stellar Press",
        "yearOfPublishing": 2024
      },
      {
        "bookId": 14,
        "bookName": "Whispers in the Dark",
        "author": "Elijah K. Simmons",
        "image": "https://i.ibb.co/RSMVw1Z/IMG-8474-removebg-preview.png",
        "review": "Whispers in the Dark is a haunting psychological thriller that will keep readers on the edge of their seats until the final page. When psychiatrist Dr. Sarah Evans receives a mysterious cassette tape containing recordings of her therapy sessions with a patient who supposedly died years ago, she is drawn into a web of intrigue and deception. As Sarah delves deeper into the secrets of her past, she discovers dark truths that threaten to unravel her sanity and plunge her into a world of nightmares. Elijah K. Simmons' writing is taut and suspenseful, building tension with each twist and turn of the plot. Whispers in the Dark is a chilling tale of obsession, betrayal, and the power of the mind, guaranteed to leave readers breathless.",
        "totalPages": 368,
        "rating": 4.7,
        "category": "Psychological Thriller",
        "tags": ["Mystery", "Suspense"],
        "publisher": "Dark Dreams Publishing",
        "yearOfPublishing": 2024
      }

]